IOsetting/FwLib_STC8/include/fw_reg_stc8a8k64d4.h
#ifndef __FW_REG_STC8A8K64D4_H__
#define __FW_REG_STC8A8K64D4_H__

#include "fw_reg_base.h"

SFR(VOCTRL,             0xBB);

#define  _CCON          0xD8
SFR(CCON,               _CCON);
SBIT(CF,                _CCON, 7);
SBIT(CR,                _CCON, 6);
SBIT(CCF3,              _CCON, 3);
SBIT(CCF2,              _CCON, 2);
SBIT(CCF1,              _CCON, 1);
SBIT(CCF0,              _CCON, 0);
SFR(CMOD,               0xD9);
SFR(CCAPM0,             0xDA);
SFR(CCAPM1,             0xDB);
SFR(CCAPM2,             0xDC);
SFR(ADCCFG,             0xDE);
SFR(IP3,                0xDF);

SFR(P7M1,               0xE1);
SFR(P7M0,               0xE2);
SFR(DPS,                0xE3);
SFR(DPL1,               0xE4);
SFR(DPH1,               0xE5);
SFR(CMPCR1,             0xE6);
SFR(CMPCR2,             0xE7);

SFR(CL,                 0xE9);
SFR(CCAP0L,             0xEA);
SFR(CCAP1L,             0xEB);
SFR(CCAP2L,             0xEC);
SFR(IP3H,               0xEE);
SFR(AUXINTIF,           0xEF);

SFR(PWMSET,             0xF1);
SFR(PCA_PWM0,           0xF2);
SFR(PCA_PWM1,           0xF3);
SFR(PCA_PWM2,           0xF4);
SFR(IAP_TPS,            0xF5);
SFR(PWMCFG,             0xF6);


SFR(CH,                 0xF9);
SFR(CCAP0H,             0xFA);
SFR(CCAP1H,             0xFB);
SFR(CCAP2H,             0xFC);

SFR(RSTCFG,             0xFF);

/**
 * Set B7 of P_SW2 before read/write the following registers
*/

/////////////////////////////////////////////////
//FF00H-FFFFH
/////////////////////////////////////////////////

#define     PWMC        (*(unsigned int  volatile __XDATA *)0xff00)
#define     PWMCH       (*(unsigned char volatile __XDATA *)0xff00)
#define     PWMCL       (*(unsigned char volatile __XDATA *)0xff01)
#define     PWMCKS      (*(unsigned char volatile __XDATA *)0xff02)
#define     PWMTADC     (*(unsigned int  volatile __XDATA *)0xff03)
#define     PWMTADCH    (*(unsigned char volatile __XDATA *)0xff03)
#define     PWMTADCL    (*(unsigned char volatile __XDATA *)0xff04)
#define     PWMIF       (*(unsigned char volatile __XDATA *)0xff05)
#define     PWMFDCR     (*(unsigned char volatile __XDATA *)0xff06)
#define     PWMDELSEL   (*(unsigned char volatile __XDATA *)0xff07)
#define     PWM0T1      (*(unsigned int  volatile __XDATA *)0xff10)
#define     PWM0T1H     (*(unsigned char volatile __XDATA *)0xff10)
#define     PWM0T1L     (*(unsigned char volatile __XDATA *)0xff11)
#define     PWM0T2      (*(unsigned int  volatile __XDATA *)0xff12)
#define     PWM0T2H     (*(unsigned char volatile __XDATA *)0xff12)
#define     PWM0T2L     (*(unsigned char volatile __XDATA *)0xff13)
#define     PWM0CR      (*(unsigned char volatile __XDATA *)0xff14)
#define     PWM0HLD     (*(unsigned char volatile __XDATA *)0xff15)
#define     PWM1T1      (*(unsigned int  volatile __XDATA *)0xff18)
#define     PWM1T1H     (*(unsigned char volatile __XDATA *)0xff18)
#define     PWM1T1L     (*(unsigned char volatile __XDATA *)0xff19)
#define     PWM1T2      (*(unsigned int  volatile __XDATA *)0xff1a)
#define     PWM1T2H     (*(unsigned char volatile __XDATA *)0xff1a)
#define     PWM1T2L     (*(unsigned char volatile __XDATA *)0xff1b)
#define     PWM1CR      (*(unsigned char volatile __XDATA *)0xff1c)
#define     PWM1HLD     (*(unsigned char volatile __XDATA *)0xff1d)
#define     PWM2T1      (*(unsigned int  volatile __XDATA *)0xff20)
#define     PWM2T1H     (*(unsigned char volatile __XDATA *)0xff20)
#define     PWM2T1L     (*(unsigned char volatile __XDATA *)0xff21)
#define     PWM2T2      (*(unsigned int  volatile __XDATA *)0xff22)
#define     PWM2T2H     (*(unsigned char volatile __XDATA *)0xff22)
#define     PWM2T2L     (*(unsigned char volatile __XDATA *)0xff23)
#define     PWM2CR      (*(unsigned char volatile __XDATA *)0xff24)
#define     PWM2HLD     (*(unsigned char volatile __XDATA *)0xff25)
#define     PWM3T1      (*(unsigned int  volatile __XDATA *)0xff28)
#define     PWM3T1H     (*(unsigned char volatile __XDATA *)0xff28)
#define     PWM3T1L     (*(unsigned char volatile __XDATA *)0xff29)
#define     PWM3T2      (*(unsigned int  volatile __XDATA *)0xff2a)
#define     PWM3T2H     (*(unsigned char volatile __XDATA *)0xff2a)
#define     PWM3T2L     (*(unsigned char volatile __XDATA *)0xff2b)
#define     PWM3CR      (*(unsigned char volatile __XDATA *)0xff2c)
#define     PWM3HLD     (*(unsigned char volatile __XDATA *)0xff2d)
#define     PWM4T1      (*(unsigned int  volatile __XDATA *)0xff30)
#define     PWM4T1H     (*(unsigned char volatile __XDATA *)0xff30)
#define     PWM4T1L     (*(unsigned char volatile __XDATA *)0xff31)
#define     PWM4T2      (*(unsigned int  volatile __XDATA *)0xff32)
#define     PWM4T2H     (*(unsigned char volatile __XDATA *)0xff32)
#define     PWM4T2L     (*(unsigned char volatile __XDATA *)0xff33)
#define     PWM4CR      (*(unsigned char volatile __XDATA *)0xff34)
#define     PWM4HLD     (*(unsigned char volatile __XDATA *)0xff35)
#define     PWM5T1      (*(unsigned int  volatile __XDATA *)0xff38)
#define     PWM5T1H     (*(unsigned char volatile __XDATA *)0xff38)
#define     PWM5T1L     (*(unsigned char volatile __XDATA *)0xff39)
#define     PWM5T2      (*(unsigned int  volatile __XDATA *)0xff3a)
#define     PWM5T2H     (*(unsigned char volatile __XDATA *)0xff3a)
#define     PWM5T2L     (*(unsigned char volatile __XDATA *)0xff3b)
#define     PWM5CR      (*(unsigned char volatile __XDATA *)0xff3c)
#define     PWM5HLD     (*(unsigned char volatile __XDATA *)0xff3d)
#define     PWM6T1      (*(unsigned int  volatile __XDATA *)0xff40)
#define     PWM6T1H     (*(unsigned char volatile __XDATA *)0xff40)
#define     PWM6T1L     (*(unsigned char volatile __XDATA *)0xff41)
#define     PWM6T2      (*(unsigned int  volatile __XDATA *)0xff42)
#define     PWM6T2H     (*(unsigned char volatile __XDATA *)0xff42)
#define     PWM6T2L     (*(unsigned char volatile __XDATA *)0xff43)
#define     PWM6CR      (*(unsigned char volatile __XDATA *)0xff44)
#define     PWM6HLD     (*(unsigned char volatile __XDATA *)0xff45)
#define     PWM7T1      (*(unsigned int  volatile __XDATA *)0xff48)
#define     PWM7T1H     (*(unsigned char volatile __XDATA *)0xff48)
#define     PWM7T1L     (*(unsigned char volatile __XDATA *)0xff49)
#define     PWM7T2      (*(unsigned int  volatile __XDATA *)0xff4a)
#define     PWM7T2H     (*(unsigned char volatile __XDATA *)0xff4a)
#define     PWM7T2L     (*(unsigned char volatile __XDATA *)0xff4b)
#define     PWM7CR      (*(unsigned char volatile __XDATA *)0xff4c)
#define     PWM7HLD     (*(unsigned char volatile __XDATA *)0xff4d)

/////////////////////////////////////////////////
//FE00H-FEFFH
/////////////////////////////////////////////////

#define     CKSEL       (*(unsigned char volatile __XDATA *)0xfe00)
#define     CLKDIV      (*(unsigned char volatile __XDATA *)0xfe01)
#define     IRC24MCR    (*(unsigned char volatile __XDATA *)0xfe02)
#define     XOSCCR      (*(unsigned char volatile __XDATA *)0xfe03)
#define     IRC32KCR    (*(unsigned char volatile __XDATA *)0xfe04)
#define     MCLKOCR     (*(unsigned char volatile __XDATA *)0xfe05)
#define     IRCDB       (*(unsigned char volatile __XDATA *)0xfe06)
                         
#define     P0PU        (*(unsigned char volatile __XDATA *)0xfe10)
#define     P1PU        (*(unsigned char volatile __XDATA *)0xfe11)
#define     P2PU        (*(unsigned char volatile __XDATA *)0xfe12)
#define     P3PU        (*(unsigned char volatile __XDATA *)0xfe13)
#define     P4PU        (*(unsigned char volatile __XDATA *)0xfe14)
#define     P5PU        (*(unsigned char volatile __XDATA *)0xfe15)
#define     P6PU        (*(unsigned char volatile __XDATA *)0xfe16)
#define     P7PU        (*(unsigned char volatile __XDATA *)0xfe17)
#define     P0NCS       (*(unsigned char volatile __XDATA *)0xfe18)
#define     P1NCS       (*(unsigned char volatile __XDATA *)0xfe19)
#define     P2NCS       (*(unsigned char volatile __XDATA *)0xfe1a)
#define     P3NCS       (*(unsigned char volatile __XDATA *)0xfe1b)
#define     P4NCS       (*(unsigned char volatile __XDATA *)0xfe1c)
#define     P5NCS       (*(unsigned char volatile __XDATA *)0xfe1d)
#define     P6NCS       (*(unsigned char volatile __XDATA *)0xfe1e)
#define     P7NCS       (*(unsigned char volatile __XDATA *)0xfe1f)
#define     P0SR        (*(unsigned char volatile __XDATA *)0xfe20)
#define     P1SR        (*(unsigned char volatile __XDATA *)0xfe21)
#define     P2SR        (*(unsigned char volatile __XDATA *)0xfe22)
#define     P3SR        (*(unsigned char volatile __XDATA *)0xfe23)
#define     P4SR        (*(unsigned char volatile __XDATA *)0xfe24)
#define     P5SR        (*(unsigned char volatile __XDATA *)0xfe25)
#define     P6SR        (*(unsigned char volatile __XDATA *)0xfe26)
#define     P7SR        (*(unsigned char volatile __XDATA *)0xfe27)
#define     P0DR        (*(unsigned char volatile __XDATA *)0xfe28)
#define     P1DR        (*(unsigned char volatile __XDATA *)0xfe29)
#define     P2DR        (*(unsigned char volatile __XDATA *)0xfe2a)
#define     P3DR        (*(unsigned char volatile __XDATA *)0xfe2b)
#define     P4DR        (*(unsigned char volatile __XDATA *)0xfe2c)
#define     P5DR        (*(unsigned char volatile __XDATA *)0xfe2d)
#define     P6DR        (*(unsigned char volatile __XDATA *)0xfe2e)
#define     P7DR        (*(unsigned char volatile __XDATA *)0xfe2f)
#define     PxIE                                            0xfe30
#define     P0IE        (*(unsigned char volatile __XDATA *)0xfe30)
#define     P1IE        (*(unsigned char volatile __XDATA *)0xfe31)
#define     P2IE        (*(unsigned char volatile __XDATA *)0xfe32)
#define     P3IE        (*(unsigned char volatile __XDATA *)0xfe33)
#define     P4IE        (*(unsigned char volatile __XDATA *)0xfe34)
#define     P5IE        (*(unsigned char volatile __XDATA *)0xfe35)
#define     P6IE        (*(unsigned char volatile __XDATA *)0xfe36)
#define     P7IE        (*(unsigned char volatile __XDATA *)0xfe37)
                        
